import AIPage from '../../base/ai_page';
AIPage({

	/**
	 * 页面的初始数据
	 */
	data: {
		text: `
	欢迎您使用我们的AI大模型问答机器人移动版平台APP产品！在使用之前，请仔细阅读以下用户协议。当您点击“同意”或使用我们的服务时，即表示您已经阅读、理解并同意遵守本协议的全部条款和条件。\n
	
	一、接受条款\n
	
	1.1 本协议是您与我们之间关于使用AI大模型问答机器人移动版平台APP产品的法律协议。在使用本产品前，您应当仔细阅读本协议的全部内容。\n
	
	1.2 如果您不同意本协议的任何内容，请您立即停止使用本产品。\n
	
	1.3 我们保留随时修改本协议的权利，修改后的协议内容将在产品上公布并立即生效。您可以随时查阅最新的协议版本。\n
	
	二、服务内容\n
	
	2.1 AI大模型问答机器人移动版平台APP产品是基于Chat GPT的智能助理机器人，可以智能回答问题及绘画。此外，我们还提供与社交产品的集成功能，比如微信、企业微信等。\n
	
	2.2 我们将尽力保证服务的稳定性和安全性，但不对服务的及时性、准确性、完整性、可靠性做出任何承诺。\n
	
	三、用户权利与义务\n
	
	3.1 您在使用本产品时，应遵守国家法律法规、社会公共秩序，不得利用本产品进行任何非法活动。\n
	
	3.2 您应保证提供给我们的个人信息真实、准确、完整，且您有权提供该等个人信息。\n
	
	3.3 您不得以任何形式损害本产品的知识产权，包括但不限于复制、修改、发布、传播、展示等。\n
	
	3.4 您对使用本产品过程中的行为负全部责任，包括但不限于对其他用户的交流内容、信息的真实性、合法性等。\n
	
	四、知识产权保护\n
	
	4.1 我们拥有AI大模型问答机器人移动版平台APP产品的知识产权，包括但不限于著作权、商标权、专利权等。\n
	
	4.2 未经我们的书面许可，您不得以任何形式使用、修改、复制、传播、展示我方的知识产权。\n
	
	五、免责声明\n
	
	5.1 由于网络技术的发展和不可抗力的因素，我们不能保证本产品的服务将满足您的全部需求，也不能保证服务不会中断或出现错误。\n
	
	5.2 对于因您使用本产品所产生的任何直接或间接的损失，我们不承担任何责任。\n
	
	六、协议终止\n
	
	6.1 您可以随时停止使用本产品，或者通过联系我们的客服注销您的账号。\n
	
	6.2 如您违反了本协议的任何条款，我们有权立即终止向您提供服务，并保留追究您法律责任的权利。\n
	
	七、其他条款\n
	
	7.1 本协议适用中华人民共和国法律，如发生任何争议，应通过友好协商解决。协商不成的，您同意将争议提交至有管辖权的人民法院解决。\n
	
	7.2 如果本协议的任何条款被认定为无效或不可执行，不影响其他条款的继续有效。\n
	
	7.3 本协议的标题仅为方便阅读而设，不影响对于条款的解释和理解。\n
	
	感谢您阅读并同意本用户协议。我们将竭诚为您提供优质的AI大模型问答机器人移动版平台APP产品和服务！\n
	
	如有任何关于隐私协议的疑问或意见，请联系我们,微信号:rocy-data。感谢您的信任和支持！\n\n
	
	                             日期： 2024-3-1\n
	
	                             若馨科技产品团队\n`
	},

	/**
	 * 生命周期函数--监听页面加载
	 */
	onLoad(options) {

	},

	/**
	 * 生命周期函数--监听页面初次渲染完成
	 */
	onReady() {

	},

	/**
	 * 生命周期函数--监听页面显示
	 */
	onShow() {

	},

	/**
	 * 生命周期函数--监听页面隐藏
	 */
	onHide() {

	},

	/**
	 * 生命周期函数--监听页面卸载
	 */
	onUnload() {

	},

	/**
	 * 页面相关事件处理函数--监听用户下拉动作
	 */
	onPullDownRefresh() {

	},

	/**
	 * 页面上拉触底事件的处理函数
	 */
	onReachBottom() {

	}
})