// pages/privacy_protocol/privacy_protocol.js
Page({
  /**
   * 页面的初始数据
   */
  data: {
	text:`
欢迎使用我们开发的基于Chat GPT的AI大模型问答机器人移动版平台APP产品。在使用本产品之前，请您仔细阅读以下隐私协议，以了解我们收集、使用和保护您的个人信息的方式。\n
1. 信息收集\n
1.1. 我们可能会收集您在使用本产品时提供的个人信息，包括但不限于姓名、联系方式、地理位置等。这些信息将用于提供更好的服务和个性化的用户体验。\n
1.2. 我们还可能在您使用本产品时自动收集某些信息，包括但不限于设备标识符、操作系统版本、网络信息等。这些信息将用于产品改进、故障排除和安全性分析。\n
1.3. 为了提供更准确和个性化的服务，我们可能会使用Cookie等技术来收集和存储您的偏好设置、用户使用模式等信息。\n\n
2. 信息使用\n
2.1. 我们将使用收集的信息来提供、维护和改进本产品的功能和性能。\n
2.2. 我们可能会使用您的个人信息来向您发送与产品相关的通知、更新和营销信息。\n
2.3. 我们可能会使用您的个人信息进行用户行为分析，以改进产品的用户体验和服务质量。\n\n
3. 信息共享\n
3.1. 除非获得您的明确同意或法律要求，否则我们不会将您的个人信息提供给第三方。\n
3.2. 在提供服务的过程中，我们可能会与第三方合作伙伴共享某些信息，以实现更好的产品功能和服务。我们会要求这些合作伙伴保护您的个人信息安全。\n\n
4. 信息保护\n
4.1. 我们采取合理的安全措施来保护您的个人信息，防止未经授权的访问、使用、披露、修改或损坏。\n
4.2. 在您使用本产品时，您需要妥善保管您的账户信息，避免将其泄露给他人。如发现您的账户信息被盗用或存在安全问题，请立即联系我们。\n\n
5. 其他条款\n
5.1. 本隐私协议适用于本产品的所有用户。\n
5.2. 我们可能会根据法律法规和产品运营需要，不时更新本隐私协议。更新后的隐私协议将在本产品中以适当方式通知您。\n
5.3. 如您继续使用本产品，即表示您同意本隐私协议的条款。\n
如有任何关于隐私协议的疑问或意见，请联系我们,微信号:rocy-data。感谢您的信任和支持！\n\n\n
                                日期： 2024-3-1\n
                                若馨科技产品团队\n	
	`
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {
  },
  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {
  },
  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {
  },
  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {
  },
  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {
  },
  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {
  },
  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {
  },
})